# Инструкции по созданию имиджа
FROM node
# from ищет модуль локально либо на докерхабе

# Образ служит только для чтения
WORKDIR /app
# workdir указывает папку приложения в образе

# *** оптимизация загрузки node_modules при сборке - если изменений нет, докер берет файлы из кеша 
COPY package.json /app
# RUN запускается при создании образа, CMD - при запуске образа
RUN npm install


COPY . .
# "." - какие файлы добавлять в образ "." - в какую папку в образе (либо WORKDIR) 

ENV PORT=3000

# Порт при запуске приложения
EXPOSE $PORT

CMD [ "node", "app.js" ]